<s>	0
<pad>	0
</s>	0
<unk>	0
▁	-1.94346
e	-2.0247
n	-2.52771
i	-2.69095
r	-2.81179
t	-2.99429
s	-3.07457
a	-3.08727
d	-3.37853
h	-3.41543
u	-3.52845
l	-3.53925
o	-3.76429
c	-3.83672
g	-3.89086
m	-4.03425
.	-4.27171
b	-4.34078
f	-4.45167
w	-4.51255
k	-4.68054
z	-4.81542
S	-4.96966
v	-5.01738
p	-5.09819
,	-5.11371
D	-5.22687
ü	-5.34517
E	-5.43072
ä	-5.43483
A	-5.61389
B	-5.67037
M	-5.68285
G	-5.93387
"	-5.94796
F	-5.95252
K	-5.99114
P	-6.03568
W	-6.0592
T	-6.08128
y	-6.08834
H	-6.14664
ö	-6.17763
I	-6.18576
R	-6.22513
L	-6.30172
-	-6.34074
C	-6.41901
V	-6.44441
N	-6.48507
ß	-6.60475
Z	-6.78851
J	-6.81489
U	-7.04154
j	-7.07161
O	-7.13538
x	-7.50985
?	-7.66957
!	-8.34983
'	-8.62779
q	-8.7511
Y	-8.80869
Ü	-9.0344
:	-9.03696
Q	-9.11993
Ä	-9.61997
Ö	-9.9612
;	-10.0729
(	-10.0826
)	-10.0839
X	-10.6277
0	-11.1096
1	-11.1164
[	-11.296
]	-11.296
é	-11.3293
2	-11.4413
&	-12.1488
3	-12.188
5	-12.3864
4	-12.4237
7	-12.4891
9	-12.6035
8	-12.6343
6	-12.666
/	-12.9645
á	-13.1043
ō	-13.392
ó	-13.5351
ñ	-13.6151
ú	-13.9028
í	-14.1541
ā	-14.1541
è	-14.2282
*	-14.3953
ć	-14.7137
à	-14.8472
ê	-14.8472
ë	-14.8472
¡	-15.0014
ç	-15.0014
ð	-15.0014
ã	-15.1837
č	-15.1837
ū	-15.1837
%	-15.4069
É	-15.4069
â	-15.4069
ø	-15.4069
š	-15.4069
å	-15.6945
ô	-15.6945
ł	-15.6945
œ	-15.6945
ş	-15.6945
Š	-15.6945
_	-16.1
Î	-16.1
Ó	-16.1
æ	-16.1
ï	-16.1
ă	-16.1
ě	-16.1
ī	-16.1
ı	-16.1
ʻ	-16.1
ʿ	-16.1
π	-16.1
и	-16.1
к	-16.1
=	-16.7932
Ã	-16.7932
Ø	-16.7932
î	-16.7932
û	-16.7932
þ	-16.7932
ċ	-16.7932
Č	-16.7932
ę	-16.7932
ğ	-16.7932
ń	-16.7932
Ō	-16.7932
ő	-16.7932
ř	-16.7932
ž	-16.7932
ǎ	-16.7932
α	-16.7932
В	-16.7932
е	-16.7932
з	-16.7932
й	-16.7932
л	-16.7932
н	-16.7932
ь	-16.7932
я	-16.7932
ṃ	-16.7932
ạ	-16.7932
ụ	-16.7932
→	-16.7932
≡	-16.7932
京	-16.7932
大	-16.7932
都	-16.7932
阪	-16.7932
